# 4.6 Combining & Exporting Data

## Contents list:

### Task 4.6; Steps

### 01. Importing libraries
### 02. Importing data
### 03. Merging dataframes
### 04. Exporting data

# Task 4.6

# 01. Importing libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

# 02. Importing data

In [2]:
# Project folder path as string
path = r'C:\Users\User\Desktop\Instacart Basket Analysis'

In [3]:
# Step 3 - Import orders_products.combined dataframe using the os library
df_orders_products_combined = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [4]:
# Step 5 - I. part - Import products_checked.csv data set using the os library
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col = False)

In [5]:
# Step 4 - Check the shape
df_orders_products_combined.shape

(32434489, 10)

In [6]:
# Check output
df_orders_products_combined.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [7]:
# Check the shape
df_prods.shape

(49672, 6)

In [8]:
# Check output
df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [9]:
# Dropping the Unnamed:0 column from df_prods dataframe
df_prods=df_prods.drop(columns = ['Unnamed: 0'])

In [10]:
# Re-check the shape
df_prods.shape

(49672, 5)

In [11]:
# Re-check output
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [13]:
# Dropping the _merge column from df_orders_products_combined dataframe
df_orders_products_combined=df_orders_products_combined.drop(columns = ['_merge'])

### 03. Merging dataframes

In [14]:
# Step 5 - II. part - Merging dataframes 
df_merged_=df_orders_products_combined.merge(df_prods, on = 'product_id', indicator=True)

In [15]:
# Check the output
df_merged_.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

In [16]:
# Step 6 - Merge flag frequency
df_merged_['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

### 04. Exporting data

In [17]:
# Step 7 - Exporting df_merged_ dataframe in pickle format as 'orders_products_merged.pkl'    
df_merged_.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged.pkl'))